
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.2.294.1.19
# Date: 2025-01-16 16:44

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: Ti375N1156
# Project: ti375n1156_oob
# Timing Model: C4 (preliminary)
#               NOTE: The timing data is not final

# Oscillator Constraints
########################
create_clock -period 12.5 -name osc_inst1_CLKOUT [get_ports {osc_inst1_CLKOUT}]

# PLL Constraints
#################
create_clock -period 7.500 -name feedbackclk [get_ports {feedbackclk}]
create_clock -period 4.000 -name axiclk [get_ports {axiclk}]
create_clock -period 10.000 -name apbclk [get_ports {apbclk}]

# GPIO Constraints
####################

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> -name jtag_inst1_TCK [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 2.452 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min 1.244 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.917 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.469 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 1.488 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.955 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.878 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.507 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.853 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.452 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.985 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.497 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 1.644 [get_ports {jtag_inst1_DRCK}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 1.001 [get_ports {jtag_inst1_DRCK}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> -name jtag_inst1_DRCK [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.864 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.475 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# PCIe Constraints
#####################
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_AWREADY}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_WREADY}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_BID[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_BID_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_BRESP[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_BRESP_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_BVALID}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_ARREADY}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RDATA[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RDATA_PAR[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RID[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RID_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RLAST}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RRESP[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RRESP_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_AXI_RVALID}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_TARGET_NON_POSTED_REJ}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PADDR[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PSEL}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PENABLE}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PWRITE}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PWDATA[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PWDATA_PAR[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PSTRB[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min -0.245 [get_ports {q0_USER_APB_PSTRB_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_CORRECTABLE_ERROR_IN}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min -0.245 [get_ports {q0_UNCORRECTABLE_ERROR_IN}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.562 [get_ports {q0_TARGET_AXI_AWREADY}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.967 [get_ports {q0_TARGET_AXI_WREADY}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.969 [get_ports {q0_TARGET_AXI_BID[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.499 [get_ports {q0_TARGET_AXI_BID_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.707 [get_ports {q0_TARGET_AXI_BRESP[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.869 [get_ports {q0_TARGET_AXI_BRESP_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.725 [get_ports {q0_TARGET_AXI_BVALID}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.826 [get_ports {q0_TARGET_AXI_ARREADY}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.334 [get_ports {q0_TARGET_AXI_RDATA[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.021 [get_ports {q0_TARGET_AXI_RDATA_PAR[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.834 [get_ports {q0_TARGET_AXI_RID[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.398 [get_ports {q0_TARGET_AXI_RID_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.690 [get_ports {q0_TARGET_AXI_RLAST}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.694 [get_ports {q0_TARGET_AXI_RRESP[*]}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.378 [get_ports {q0_TARGET_AXI_RRESP_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.067 [get_ports {q0_TARGET_AXI_RVALID}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 0.466 [get_ports {q0_TARGET_NON_POSTED_REJ}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.478 [get_ports {q0_USER_APB_PADDR[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 1.598 [get_ports {q0_USER_APB_PSEL}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.425 [get_ports {q0_USER_APB_PENABLE}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.444 [get_ports {q0_USER_APB_PWRITE}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.600 [get_ports {q0_USER_APB_PWDATA[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.544 [get_ports {q0_USER_APB_PWDATA_PAR[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.547 [get_ports {q0_USER_APB_PSTRB[*]}]
set_output_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 0.425 [get_ports {q0_USER_APB_PSTRB_PAR}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.170 [get_ports {q0_CORRECTABLE_ERROR_IN}]
set_output_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.267 [get_ports {q0_UNCORRECTABLE_ERROR_IN}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 2.001 [get_ports {q0_TARGET_AXI_AWADDR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_AWADDR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.902 [get_ports {q0_TARGET_AXI_AWID[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_AWID[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.949 [get_ports {q0_TARGET_AXI_AWLEN[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_AWLEN[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.793 [get_ports {q0_TARGET_AXI_AWSIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_AWSIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.973 [get_ports {q0_TARGET_AXI_AWUSER[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_AWUSER[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.410 [get_ports {q0_TARGET_AXI_AWVALID}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_AWVALID}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 2.018 [get_ports {q0_TARGET_AXI_WDATA[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_WDATA[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 2.086 [get_ports {q0_TARGET_AXI_WDATA_PAR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_WDATA_PAR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.826 [get_ports {q0_TARGET_AXI_WSTRB[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_WSTRB[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.775 [get_ports {q0_TARGET_AXI_WSTRB_PAR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_WSTRB_PAR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.546 [get_ports {q0_TARGET_AXI_WVALID}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_WVALID}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.633 [get_ports {q0_TARGET_AXI_WLAST}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_WLAST}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.496 [get_ports {q0_TARGET_AXI_BREADY}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_BREADY}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.918 [get_ports {q0_TARGET_AXI_ARADDR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_ARADDR[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.841 [get_ports {q0_TARGET_AXI_ARID[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_ARID[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.850 [get_ports {q0_TARGET_AXI_ARLEN[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_ARLEN[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.753 [get_ports {q0_TARGET_AXI_ARSIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_ARSIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.837 [get_ports {q0_TARGET_AXI_ARUSER[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_ARUSER[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.658 [get_ports {q0_TARGET_AXI_RREADY}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_RREADY}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.441 [get_ports {q0_TARGET_AXI_ARVALID}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_TARGET_AXI_ARVALID}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 2.214 [get_ports {q0_USER_APB_PRDATA[*]}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min 0.245 [get_ports {q0_USER_APB_PRDATA[*]}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 2.103 [get_ports {q0_USER_APB_PRDATA_PAR[*]}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min 0.245 [get_ports {q0_USER_APB_PRDATA_PAR[*]}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 2.054 [get_ports {q0_USER_APB_PREADY}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min 0.245 [get_ports {q0_USER_APB_PREADY}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.996 [get_ports {q0_PCIE_MAX_READ_REQ_SIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_PCIE_MAX_READ_REQ_SIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 2.004 [get_ports {q0_PCIE_MAX_PAYLOAD_SIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_PCIE_MAX_PAYLOAD_SIZE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.718 [get_ports {q0_FATAL_ERROR_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_FATAL_ERROR_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.487 [get_ports {q0_NON_FATAL_ERROR_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_NON_FATAL_ERROR_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.483 [get_ports {q0_CORRECTABLE_ERROR_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_CORRECTABLE_ERROR_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.744 [get_ports {q0_HOT_RESET_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_HOT_RESET_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.746 [get_ports {q0_LINK_DOWN_RESET_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_LINK_DOWN_RESET_OUT}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.982 [get_ports {q0_LTSSM_STATE[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_LTSSM_STATE[*]}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 2.108 [get_ports {q0_REG_ACCESS_CLK_SHUTOFF}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min 0.245 [get_ports {q0_REG_ACCESS_CLK_SHUTOFF}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -max 2.111 [get_ports {q0_CORE_CLK_SHUTOFF}]
set_input_delay -clock apbclk -reference_pin [get_ports {apbclk~CLKOUT~466~5}] -min 0.245 [get_ports {q0_CORE_CLK_SHUTOFF}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.788 [get_ports {q0_LINK_STATUS[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_LINK_STATUS[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -max 1.989 [get_ports {q0_FUNCTION_STATUS[*]}]
set_input_delay -clock axiclk -reference_pin [get_ports {axiclk~CLKOUT~466~86}] -min 0.245 [get_ports {q0_FUNCTION_STATUS[*]}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {feedbackclk}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {feedbackclk}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {axiclk}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {axiclk}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {apbclk}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {apbclk}]
